NonOffOpenFOAM/FoamCases/ppWall/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
	p 
	{
		solver 				PCG;
		preconditioner		DIC;
		tolerance			1e-6;
		relTol				0;
	}

	U
	{
		solver 				PBiCG;
		preconditioner 		DILU;
		tolerance 			1e-5;
		relTol 				0;
	}
}

PISO
{
	nCorrectors 					2;
	nNonOrthogonalCorrectors 		0;
	pRefCell						0;
	pRefValue						0;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //